flashsim_result/sysbench/ctoc_noshadow/complex_t60.out
2018. 12. 19. (수) 22:45:44 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running mixed OLTP test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            686182
        write:                           245058
        other:                           98024
        total:                           1029264
    transactions:                        49011  (816.51 per sec.)
    deadlocks:                           2      (0.03 per sec.)
    read/write requests:                 931240 (15514.22 per sec.)
    other operations:                    98024  (1633.05 per sec.)

Test execution summary:
    total time:                          60.0249s
    total number of events:              49011
    total time taken by event execution: 960.1167
    per-request statistics:
         min:                                  7.79ms
         avg:                                 19.59ms
         max:                                146.01ms
         approx.  95 percentile:              35.42ms

Threads fairness:
    events (avg/stddev):           3063.1875/3.17
    execution time (avg/stddev):   60.0073/0.00

2018. 12. 19. (수) 22:46:44 KST

-----------------------------------------------------------------

mutex_t : 0x36fe3ea8 q:0x36fe3ea0, size:2048
mutex_t : 0x36fe4478 q:0x36fe4470, size:1024
mutex_t : 0x36fe44d8 q:0x36fe44d0, size:1024
mutex_t : 0x36fe4538 q:0x36fe4530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 10955 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = 1676724473, gearRec = 395159979, aurSend = -465581926, aurRec = 1152063099, readSend=-938305210, writeSend=1876363930
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x37004378 q:0x37004370, size:1024
mutex_t : 0x3700aef8 q:0x3700aef0, size:1024
mutex_t : 0x3700af58 q:0x3700af50, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!

WAF: 1.08

WAF: 1.07

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07
tpage_GC()

WAF: 1.07

WAF: 1.07
^C


[cdf]read---
60	3	0.000001
70	1	0.000002
120	5462	0.002118
130	97940	0.040060
140	221593	0.125906
150	149592	0.183859
160	120054	0.230369
170	117290	0.275807
180	106573	0.317094
190	85024	0.350033
200	72217	0.378010
210	66675	0.403841
220	61393	0.427625
230	50743	0.447283
240	43122	0.463988
250	38943	0.479075
260	37562	0.493627
270	47676	0.512097
280	69730	0.539110
290	81923	0.570848
300	83927	0.603362
310	83406	0.635674
320	79709	0.666553
330	73755	0.695126
340	71482	0.722819
350	72336	0.750842
360	68805	0.777498
370	62114	0.801561
380	55702	0.823140
390	52300	0.843401
400	48745	0.862286
410	44103	0.879371
420	38367	0.894235
430	33759	0.907313
440	30275	0.919042
450	27064	0.929527
460	23599	0.938669
470	20545	0.946628
480	18122	0.953649
490	15996	0.959846
500	14019	0.965277
510	12144	0.969981
520	10328	0.973983
530	9009	0.977473
540	7961	0.980557
550	6953	0.983251
560	5986	0.985570
570	5135	0.987559
580	4414	0.989269
590	3909	0.990783
600	3193	0.992020
610	2868	0.993131
620	2423	0.994070
630	2129	0.994895
640	1750	0.995573
650	1539	0.996169
660	1368	0.996699
670	1218	0.997171
680	933	0.997532
690	807	0.997845
700	748	0.998135
710	628	0.998378
720	551	0.998591
730	440	0.998762
740	380	0.998909
750	310	0.999029
760	305	0.999147
770	251	0.999245
780	205	0.999324
790	180	0.999394
800	133	0.999445
810	141	0.999500
820	116	0.999545
830	94	0.999581
840	68	0.999608
850	76	0.999637
860	63	0.999661
870	54	0.999682
880	52	0.999702
890	41	0.999718
900	37	0.999733
910	32	0.999745
920	39	0.999760
930	29	0.999771
940	24	0.999781
950	29	0.999792
960	18	0.999799
970	14	0.999804
980	15	0.999810
990	12	0.999815
1000	10	0.999819
1010	14	0.999824
1020	22	0.999833
1030	14	0.999838
1040	11	0.999842
1050	12	0.999847
1060	10	0.999851
1070	15	0.999857
1080	8	0.999860
1090	6	0.999862
1100	8	0.999865
1110	8	0.999868
1120	6	0.999871
1130	2	0.999871
1140	4	0.999873
1150	1	0.999873
1160	1	0.999874
1170	3	0.999875
1180	5	0.999877
1190	3	0.999878
1200	1	0.999878
1210	1	0.999879
1220	3	0.999880
1240	1	0.999880
1250	3	0.999881
1260	2	0.999882
1270	1	0.999883
1280	2	0.999883
1290	2	0.999884
1320	1	0.999885
1470	4	0.999886
1480	2	0.999887
1490	1	0.999887
1500	1	0.999888
1620	2	0.999888
1660	2	0.999889
1680	3	0.999890
1690	1	0.999891
1700	2	0.999892
1710	2	0.999892
1720	1	0.999893
1730	1	0.999893
1740	1	0.999893
1760	1	0.999894
1770	1	0.999894
1790	3	0.999895
3150	3	0.999897
3160	2	0.999897
3170	2	0.999898
3180	1	0.999898
3310	2	0.999899
3350	1	0.999900
3360	1	0.999900
4150	1	0.999900
4160	1	0.999901
4310	2	0.999902
9490	2	0.999902
9500	2	0.999903
9510	1	0.999904
9530	1	0.999904
9540	2	0.999905
9550	4	0.999906
9560	1	0.999907
9570	2	0.999907
9580	2	0.999908
9590	3	0.999909
9600	3	0.999911
9610	3	0.999912
9620	3	0.999913
9630	4	0.999914
9640	2	0.999915
9650	2	0.999916
9660	1	0.999916
9670	2	0.999917
9680	2	0.999918
9690	3	0.999919
9700	1	0.999919
9710	3	0.999921
9730	1	0.999921
9760	1	0.999921
9770	1	0.999922
9800	2	0.999923
9810	1	0.999923
9820	2	0.999924
9860	1	0.999924
9870	4	0.999926
9880	1	0.999926
9890	3	0.999927
9900	3	0.999928
9910	2	0.999929
9920	1	0.999929
9940	3	0.999931
9950	2	0.999931
9970	5	0.999933
9980	3	0.999935
9990	4	0.999936
10000	4	0.999938
10010	4	0.999939
10020	1	0.999940
10030	2	0.999940
10040	1	0.999941
10050	2	0.999942
10060	2	0.999942
10070	9	0.999946
10080	3	0.999947
10090	3	0.999948
10100	1	0.999949
10130	4	0.999950
10150	5	0.999952
10160	2	0.999953
10170	1	0.999953
10180	5	0.999955
10190	2	0.999956
10200	3	0.999957
10210	3	0.999958
10220	2	0.999959
10230	3	0.999960
10250	2	0.999961
10260	3	0.999962
10270	1	0.999962
10280	3	0.999964
10290	3	0.999965
10310	1	0.999965
10340	1	0.999966
10350	1	0.999966
10360	1	0.999966
10380	1	0.999967
10910	1	0.999967
10920	2	0.999968
10930	2	0.999969
10940	3	0.999970
10950	2	0.999971
10960	1	0.999971
10990	1	0.999971
11000	1	0.999972
11010	1	0.999972
11020	1	0.999973
11030	2	0.999973
11050	2	0.999974
11080	2	0.999975
11090	1	0.999975
11100	1	0.999976
11110	2	0.999976
11120	2	0.999977
11130	2	0.999978
11140	2	0.999979
11150	1	0.999979
11160	1	0.999979
11170	2	0.999980
11180	1	0.999981
11190	1	0.999981
11200	3	0.999982
11210	2	0.999983
11240	1	0.999983
11250	5	0.999985
11270	5	0.999987
11280	4	0.999989
11290	1	0.999989
11300	2	0.999990
11310	1	0.999990
11320	2	0.999991
11330	2	0.999992
11360	1	0.999992
11370	1	0.999993
11400	1	0.999993
11420	2	0.999994
11430	2	0.999995
11460	1	0.999995
11480	2	0.999996
11490	1	0.999996
11500	5	0.999998
11510	1	0.999998
11530	2	0.999999
11540	1	1.000000
11670	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	67	0	3.286	119	0.00461%
1	0	11524	119	175.856	2015045	78.06391%
2	0	835	278	396.902	512	0.01984%
3	0	11529	149	364.576	565724	21.91645%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 75919.265625(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 0, 0.000000
[cache hit cnt,ratio dftl] 0, 0.000000
[READ WRITE CNT] 2581276 7136266
error cnt:210
result of ms:
---
bye bye!
# of gc: 9
# of translation page gc: 9
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 744559
# of buf hit: 4
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 0
Cache miss on read: 0
Cache hit on write: 6628405
Cache miss on write: 143307

Clean hit on read: 1582968
Dirty hit on read: 461199
Clean hit on write: 36040
Dirty hit on write: 6592365

% of miss : 0.07
# Clean eviction: 565724
# Dirty eviction: 178835

Clean eviciton on read: 565724
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 178835

Dirty eviction ratio: 24.02%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.07

0 9
1 846862
2 178835
3 710
4 710
5 2581272
6 6771712
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:42610	read_q_hit:0	retry_hit:0